# PointLocationOnCurve Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointLocationOnCurve Properties
PointLocationOnCurve Class See Also
---
The PointLocationOnCurve type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MeasureFrom | The location on the curve from which the measurement is taken. |
| MeasurementType | The measurement type. |
| MeasurementValue | The measurement value. |

# See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace